In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
import os
os.getcwd()

'/home/kakashi/intern-tracker/src/analysis'

In [5]:
data = pd.read_csv('/home/kakashi/intern-tracker/data/cleaned/indeed/2024_03_15.csv')
data.head()

,title,company,salary,location,link,date,query,source
0,Python Developer,Infosys,NaN,"Pune, Maharashtra",https://in.indeed.com/rc/clk?jk=b0a156d0bd60b7...,Posted 2 days ago,python developer,indeed
1,Junior Python Developer,1E9 Advisors,NaN,"Aundh, Pune, Maharashtra",https://in.indeed.com/rc/clk?jk=6227a113217cc2...,Posted 24 days ago,python developer,indeed
2,Entry-Level Software Developer,Tantransh Solutions,NaN,"Bajaj Nagar, Nagpur, Maharashtra",https://in.indeed.com/rc/clk?jk=43540174e00001...,Posted 13 days ago,python developer,indeed
3,Python Developer,QuantGrade,NaN,"Remote in Noida, Uttar Pradesh",https://in.indeed.com/rc/clk?jk=055ccbf93d79b7...,Posted 7 days ago,python developer,indeed
4,Python (Programming Language)-Application Deve...,Accenture,NaN,"Bengaluru, Karnataka",https://in.indeed.com/rc/clk?jk=62317f94ed4532...,Today,python developer,indeed

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 225 entries, 0 to 224
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   title     218 non-null    object
 1   company   225 non-null    object
 2   salary    31 non-null     object
 3   location  225 non-null    object
 4   link      225 non-null    object
 5   date      225 non-null    object
 6   query     225 non-null    object
 7   source    225 non-null    object
dtypes: object(8)
memory usage: 14.2+ KB

In [9]:
data.shape

(225, 8)

In [8]:
data.describe().T

         count unique                        top freq
title      218    117           Python Developer   37
company    225    154                     Oracle   11
salary      31     29  ₹15,000 - ₹70,000 a month    2
location   225     52                     Remote   44
link       225    219   https://in.indeed.comnan    7
date       225     31        Posted 30+ days ago   52
query      225      3           python developer   75
source     225      1                     indeed  225

In [10]:
print(data.salary.unique())

[nan '₹10,00,000 - ₹12,00,000 a year' 'Up to ₹50,000 a month'
 '₹15,000 - ₹70,000 a month' '₹20,000 - ₹30,000 a month'
 'Up to ₹5,00,000 a year' '₹15,000 - ₹25,000 a month'
 '₹41,40,000 - ₹62,10,000 a year' '₹8,00,000 - ₹18,00,000 a year'
 'Up to ₹60,000 a month' '₹30,000 - ₹45,000 a month'
 '₹25,000 - ₹80,000 a month' '₹1,44,000 - ₹3,60,000 a year'
 '₹40,000 - ₹60,000 a month' 'From ₹90,000 a month'
 '₹90,000 - ₹1,00,000 a month' '₹10,00,000 - ₹26,00,000 a year'
 '₹80,000 - ₹1,00,000 a month' '₹40,000 a month'
 '₹30,00,000 - ₹35,00,000 a year' '₹4,00,000 - ₹5,00,000 a year'
 '₹40,000 - ₹45,000 a month' '₹4,00,000 - ₹8,00,000 a year'
 '₹90,000 - ₹1,60,000 a month' '₹10,00,000 - ₹25,00,000 a year'
 '₹8,00,000 - ₹12,00,000 a year' '₹15,000 - ₹30,000 a month'
 '₹35,000 - ₹65,000 a month' '₹30,000 - ₹50,000 a month'
 '₹11,547.68 - ₹52,691.43 a month']

In [ ]:
def process_salary(sample):
    salary = sample['salary']
    if salary !='NaN':
        if salary.endswith('year'):